loadtest/scenario-chat.yml
config:
  target: "wss://buzz.bobby-demo.site/ws"
  processor: "./processor.js"
  phases:
    - duration: 100
      arrivalRate: 1
scenarios:
  - engine: "ws"
    flow:
      - function: "initWs"
      - send:
          type: subscription
          target:
            channel: chat
            topic: "{{ topic }}"
          payload:
            data: ""
      - loop:
        - send:
              type: heartbeat
              target:
                channel: chat
                topic: "{{ topic }}"
              key: "{{ username}}"
              payload: "{{ heartbeat }}"
        - send:
              type: message
              target:
                  channel: chat
                  topic: "{{ topic }}"
              payload:
                data: "{{ message }}"
        - think: 2
        count: 100